s = str(input('Введіть рядок: '))
n = int(input('Введіть мінімальну довжину слова: ')) # довжина, вказана користувачем
l = list(s.split(' ')) # утворення списку слів шляхом розбиття рядка за роздільником-пропуском
print('Список слів:')
print(l)
ll=[] # створення нового списку без порожніх слів і розділових знаків
for sl in l:
    w = sl.strip(':;.,!?') # вилучення зі слова початкових і кінцевих розділових знаків
    if w != '': # якщо слово не порожнє
        ll.append(w) # додати його до нового списку
print(f'Список слів, довжина яких більша за {n}:')
for w in ll:
    if len(w) > n: # порівняння з введеним значенням користувача
        print(w) # виведення слів довжиною більше, ніж введено користувачем
